using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace RayCasingKkepProject
{
    public static class MapManager
    {
        private static readonly List<int[,]> maps = new List<int[,]>
        {
                new int[,] {
            {1,1,1,1,1,1,1,1,1,1},
            {1,0,0,0,0,9,0,0,0,1},
            {1,0,1,1,0,1,0,1,0,1},
            {1,0,1,0,0,1,0,1,0,1},
            {1,0,1,0,1,1,0,0,0,1},
            {1,0,0,0,0,2,0,1,0,1},
            {1,0,1,1,0,1,0,1,0,1},
            {1,0,1,0,0,1,0,1,0,1},
            {1,9,0,0,0,0,0,0,0,1},
            {1,1,1,1,1,1,1,1,1,1}
             },
             new int[,] {
            {1,1,1,1,1,1,1,1,1,1},
            {1,0,0,0,0,0,0,0,0,1},
            {1,0,1,1,1,1,1,1,0,1},
            {1,0,1,9,0,0,0,1,0,1},
            {1,0,1,0,1,1,0,1,0,1},
            {1,0,1,0,0,2,0,1,0,1},
            {1,0,1,1,0,1,0,1,0,1},
            {1,0,1,0,0,1,9,1,0,1},
            {1,0,0,0,0,0,0,0,0,1},
            {1,1,1,1,1,1,1,1,1,1}
            },
            new int[,] {
            {1,1,1,1,1,1,1,1,1,1},
            {1,0,9,0,0,0,0,0,0,1},
            {1,0,1,1,1,1,1,1,0,1},
            {1,0,1,0,0,0,0,1,0,1},
            {1,0,1,0,1,1,0,1,0,1},
            {1,0,1,0,0,2,0,1,0,1},
            {1,0,1,1,0,1,0,1,0,1},
            {1,9,1,0,0,1,0,1,0,1},
            {1,0,0,0,0,0,0,0,0,1},
            {1,1,1,1,1,1,1,1,1,1}
             },
             new int[,] {
            {1,1,1,1,1,1,1,1,1,1},
            {1,0,0,0,0,0,0,0,9,1},
            {1,0,1,1,1,1,1,1,0,1},
            {1,0,1,0,0,0,0,1,0,1},
            {1,0,1,0,1,1,0,1,0,1},
            {1,0,1,0,0,2,0,1,0,1},
            {1,0,1,1,0,1,0,1,0,1},
            {1,0,1,0,0,1,0,1,0,1},
            {1,0,0,0,9,0,0,0,0,1},
            {1,1,1,1,1,1,1,1,1,1}
             }

        };

        public static int CurrentMapIndex { get; private set; } = 0;

        public static void LoadMap(int index)
        {
            if (index >= 0 && index < maps.Count)
            {
                CurrentMapIndex = index;
                Map.Load(maps[index]);
                // Обновляем текстуры для данной локации
                TextureManager.LoadLocationTextures(index);
            }
        }
    }
}

